package A_variableBasic;

/**
 * @author PC07
 *
 */
public class VariableBasic {
	public static void main(String[] args) {

//		한
//		줄
//		주
//		석
	/*
	 1. 변수란?
	 	1가지 값(어떤문자든)만 넣을수 있고 언제든지 값이 변경될수 있음.
		자바는 늘 수직으로 결과를 냄
		마지막인값만 가능함(그 전값들은 지워짐)
		자바 명칭 규칙4개(명명규칙)
		1.대소문자 구별하고 길이 제한 없음
		2.자바를 쓰기 위한 예약어는 명칭으로 사용할 수 없다.
		(keyword, reserved word)
		3.숫자로 시작해서는 안된다.
		4.특수문자는 사용 못함
		(_,$만 사용가능함)
		
		개발자간의 규칙(가독성 상향)
		1.클래스명은 대문자로 시작해야 한다.
		 메쏘드와 변수는 소문자로 시작, 메쏘드명은 소가로가있음
		2.여러단어로 이루어진 경우 첫번째 이후 단어의 첫글자는 대문자로 쓴다.
		3.상수(변수 중에 final int a = 10; 바꿀수 없는 값)명은 대문자로
		쓰고 단어와 단어사이_를 사용한다 MAX_VALUE
		4.한글은 사용하지 않는다.
		
		가문(=변수의타입) 기본형8가지, 참조형8가지를 제외한 나머지
		[변수타입][변수명];
		
		
			
		김     미란;
		
	 */
		
	int jae;
	jae = 10;
		System.out.println(jae);
//		시스템 밖으로 출력하라
	
	int dd;
	
	}
}
